app/Controllers/Bank.php

    public function index()
    {
        $bankModel = new BankModel();
        $data['bank_data'] = $bankModel->findAll();
---
SELECT *
FROM `bank`