app/Controllers/Pemasukan.php

    public function index()
    {
        $pemasukanModel = new PemasukanModel();
        $data['pemasukan_data'] = $pemasukanModel->findAll();
---
SELECT *
FROM `pemasukan`

    public function new()
    {
        helper('form');
        $kategoriModel = new KategoriModel();
        $kategori_data = $kategoriModel->findAll();
        $kategoriDropdown = array('' => 'Pilih ');
        foreach ($kategori_data as $kategori) {
            $kategoriDropdown[$kategori['id']] = $kategori['nama_kategori'];
        }
        $data['kategoriDropdown'] = $kategoriDropdown;

        $bankModel = new BankModel();
        $bank_data = $bankModel->findAll();
---
SELECT *
FROM `kategori`
SELECT *
FROM `bank`

    public function edit($id)
    {
        helper('form');
        $kategoriModel = new KategoriModel();
        $kategori_data = $kategoriModel->findAll();
        $kategoriDropdown = array(null => 'Pilih Kategori');
        foreach ($kategori_data as $kategori) {
            $kategoriDropdown[$kategori['id']] = $kategori['nama_kategori'];
        }
        $data['kategoriDropdown'] = $kategoriDropdown;

        $bankModel = new BankModel();
        $bank_data = $bankModel->findAll();
        $bankDropdown = array('' => 'Pilih ');
        foreach ($bank_data as $bank) {
            $bankDropdown[$bank['id']] = $bank['nama_bank'];
        }
        $data['bankDropdown'] = $bankDropdown;

        $pemasukan = new pemasukanModel();
        $data['pemasukan'] = $pemasukan->where('id', $id)->first();
---
SELECT *
FROM `kategori`
SELECT *
FROM `bank`
SELECT *
FROM `pemasukan`
WHERE `id` = '12'
 LIMIT 1