app/Controllers/Pengeluaran.php

SELECT *
FROM `pengeluaran`
---
    public function index()
    {
        $pengeluaranModel = new PengeluaranModel();
        $data['pengeluaran_data'] = $pengeluaranModel->findAll();