app/Models/PemasukanModel.php

    function sumPemasukan()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('pemasukan');

        $builder->selectSum('nominal_pemasukan');
        $query = $builder->get();
---
SELECT SUM(`nominal_pemasukan`) AS `nominal_pemasukan`
FROM `pemasukan`