app/Models/PengeluaranModel.php

    function sumPengeluaran()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('pengeluaran');

        $builder->selectSum('nominal_pengeluaran');
        $query = $builder->get();
---
SELECT SUM(`nominal_pengeluaran`) AS `nominal_pengeluaran`
FROM `pengeluaran`