app/Views/pemasukan.php

SELECT *
FROM `kategori`
WHERE `id` = '3'
 LIMIT 1
SELECT *
FROM `bank`
WHERE `id` = '8'
 LIMIT 1
---

          $no = 1;
          foreach ($pemasukan_data as $pemasukan) :
            $nama_kategori = $kategoriModel->where('id', $pemasukan['kategori_id'])->first()['nama_kategori'];
            $nama_bank = $bankModel->where('id', $pemasukan['bank_id'])->first()['nama_bank'];