app/Views/pengeluaran.php

SELECT *
FROM `kategori`
WHERE `id` = '3'
 LIMIT 1
SELECT *
FROM `bank`
WHERE `id` = '9'
 LIMIT 1
---

          $no = 1;
          foreach ($pengeluaran_data as $pengeluaran) :
            $nama_kategori = $kategoriModel->where('id',$pengeluaran['kategori_id'])->first()['nama_kategori'];
            $nama_bank = $bankModel->where('id', $pengeluaran['bank_id'])->first()['nama_bank'];